Table of Contents
 Class StringIdentifier<T>
Namespace
IdeaStatiCa.BimApiLink.Identifiers
Assembly
IdeaStatiCa.BimApiLink.dll
public class StringIdentifier<T> : ImmutableIdentifier<T>, IIdentifier, IIdeaPersistenceToken, IEquatable<IIdentifier> where T : IIdeaObject
Type Parameters
T
Inheritance
object
Identifier<T>
ImmutableIdentifier<T>
StringIdentifier<T>
Implements
IIdentifier
IIdeaPersistenceToken
IEquatable<IIdentifier>
Inherited Members
 ImmutableIdentifier<T>.GetStringId()
 Identifier<T>.ObjectType
 Identifier<T>.Equals(IIdentifier)
 Identifier<T>.Equals(object)
 Identifier<T>.GetHashCode()
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 StringIdentifier(string)
public StringIdentifier(string id)
Parameters
id string
 StringIdentifier(string, string)
protected StringIdentifier(string id, string typeName)
Parameters
id string
typeName string
Properties
 Id
public string Id { get; }
Property Value
string
Methods
 GetId()
public override object GetId()
Returns
object
 Edit this page